from flask import Flask, request
import traceback

import main
import settings

app = Flask(__name__)

# ---------------------------------------------------------------------------------------------------------------------
# граб пост запросов с серверов ВК
# ---------------------------------------------------------------------------------------------------------------------


@app.route('/vk', methods=['POST'])
def processing():
    data = request.get_json(force=True)
    if 'type' not in data:
        return 'not vk'
    else:
        if data['type'] == 'confirmation':
            return settings.confirmation_token
        return main.response_handler_for_vk(data)


# ---------------------------------------------------------------------------------------------------------------------
# генератор ответов
# ---------------------------------------------------------------------------------------------------------------------


# ---------------------------------------------------------------------------------------------------------------------
# граб ошибок и отправка их в лс админу
# ---------------------------------------------------------------------------------------------------------------------


@app.errorhandler(500)
def error_handler(e):
    # уведомляете админа об ошибке
    main.error_notificator(traceback.format_exc())
    # возвращаете ВК ok
    return 'ok'
